
&НаКлиенте
Процедура ВыполнитьУдаление(Команда)
	ТекстВопроса = "Выполнить удаление документов?";
	Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Отмена) = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьУдалениеСервер();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьУдалениеСервер()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	//доделать сдвиг бухитогов
	Для Каждого Д из Метаданные.Документы Цикл
		
		Если Д.Реквизиты.Найти("Организация")=Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		//ну да, запрос в цикле, а что делать :)
		Запрос.Текст = "ВЫБРАТЬ
		               |	Док.Ссылка
		               |ИЗ
		               |	Документ.ЧекККМ КАК Док
		               |ГДЕ
		               |	Док.Дата МЕЖДУ &ДатаНач И &ДатаКон
		               |	И Док.Организация = &Организация
		               |УПОРЯДОЧИТЬ ПО
		               |	Док.Дата";
					   
		//Это чтобы можно быть текст запрос открывать в конструкторе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЧекККМ",Д.Имя);
		
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ИспользоватьФоновыеЗадания Тогда
			
			Выборка = Рез.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ъ = Выборка.Ссылка.ПолучитьОбъект();
				
				Если Непосредственно Тогда
					ъ.Удалить();
				Иначе	
					ъ.УстановитьПометкуУдаления(Истина);
				КонецЕсли;	
				
			КонецЦикла;
			
		Иначе
			//28 05 16
			
			
			НЗ = 1;
			
			ЭтоСервер = ?(Найти(СтрокаСоединенияИнформационнойБазы(), "Srvr")=0,Ложь,Истина);
			
			т = Новый ТаблицаЗначений;
			т.Колонки.Добавить("Ссылка");
			
			Выборка = Рез.Выбрать();
			ф = Выборка.Следующий();
			Пока ф Цикл
				
				м = 0;
				т.Очистить();
				
				Пока ф И м <= КоличествоДокументовВПакете Цикл
					й 			= т.Добавить();
					й.Ссылка 	= Выборка.Ссылка;
					ф = Выборка.Следующий();
				КонецЦикла;
				
				Если ЭтоСервер Тогда
					
					МПараметры = Новый Массив;
					МПараметры.Добавить(т);
					МПараметры.Добавить(НЗ);
					МПараметры.Добавить(Непосредственно);
					
					ЗапуститьВФоне("_Имя_Общего_Модуля_.ВыполнитьУдалениеСервер_Фон", МПараметры, ф);
					
					НЗ = НЗ + 1; 
				Иначе
					//если данная процедура будет вызываться из общего модуля, то следует дописать имя общего модуля впереди.
					//можно оставить вызов из этого модуля, но тогда следует помнить, что существует 2 одинаковых процедуры
					//и при внесении изменений в одну, также модифицировать и другую, чтобы не допускать различий в алгоритме.
					ВыполнитьУдалениеСервер_Фон(т, НЗ, Непосредственно);
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЦикла;	 //по документам из метаданных
	
КонецПроцедуры

//эту процедуру следует поместить в серверный общий модуль
&НаСервере
Процедура ВыполнитьУдалениеСервер_Фон(т, НЗ, Непосредственно)
	
	Для Каждого стр Из т Цикл
		
		ъ = стр.Ссылка.ПолучитьОбъект();
		
		Если Непосредственно Тогда
			ъ.Удалить();
		Иначе	
			ъ.УстановитьПометкуУдаления(Истина);
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьВФоне(ИмяМетода, МПараметры, ф)
	
	Попытка
		МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода,Состояние", ИмяМетода, СостояниеФоновогоЗадания.Активно));
	Исключение
		МассивЗаданий = Новый Массив;
	КонецПопытки;
	
	Задание = ФоновыеЗадания.Выполнить(ИмяМетода, МПараметры, Неопределено, "Удаление документов в фоне. Infostart.ru № 72148");
	
	МассивЗаданий.Добавить(Задание);
		
	Если (МассивЗаданий.Количество() >= КоличествоОдновременныхПроцессов) ИЛИ (НЕ ф) Тогда
		ФоновыеЗадания.ОжидатьЗавершения(МассивЗаданий);
		МассивЗаданий.Очистить();
	КонецЕсли;
	
КонецПроцедуры







//Интерфейс


&НаКлиенте
Процедура ИспользоватьФоновыеЗаданияПриИзменении(Элемент)
	ЭтоСервер = ?(Найти(СтрокаСоединенияИнформационнойБазы(), "Srvr")=0,Ложь,Истина);
	Если НЕ ЭтоСервер Тогда
		Предупреждение("Вы используете файловый вариант БД. Запуск заданий в фоне невозможен! Задания будут разделены на пакеты, но запускать будут последовательно");
		//ИспользоватьФоновыеЗадания = Ложь;
	КонецЕсли;
КонецПроцедуры
