
Процедура КнопкаВыполнитьНажатие(Кнопка)

	Если НЕ ЗначениеЗаполнено(ФормОрганизация) Тогда
		Предупреждение("Выберите организацию!",60);
		Возврат;
	КонецЕсли;
	
	Если Вопрос("Удалить все документы по организации "+СокрЛП(ФормОрганизация)+"?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьУдалениеДокументов(ЭлементыФормы.ДатаНач.Значение,
								ЭлементыФормы.ДатаКон.Значение,
								ЭлементыФормы.ФормОрганизация.Значение,
								флНепосредственно);
	
	Предупреждение("Удаление документов завершено!",60);
	
КонецПроцедуры

Процедура КнопкаВыборПериодаНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.ДатаНачала = ДатаНач;
	НастройкаПериода.ДатаОкончания = ДатаКон;
	НастройкаПериода.Редактировать();
	ДатаНач = НастройкаПериода.ДатаНачала;
	ДатаКон = НастройкаПериода.ДатаОкончания;	
КонецПроцедуры